'''Задача 1
a = int(input('Введите трехзначное число: '))
summ = a//100+a//10%10+a%10
mult = (a//100)*(a//10%10)*(a%10)
print(f'Сумма цифр числа {a} = {summ}')
print(f'Произведение цифр числа {a} = {mult}')
'''

'''Задача 2
a = 5 & 6
b = 5 | 6
c = 5 ^ 6
d = 5 >> 2
e = 5 << 2
print (f' «И» 5 и 6 = {a}')
print (f' «ИЛИ» 5 и 6 = {b}')
print (f' сдвиг вправо на 2 числа 5  = {d}')
print (f' сдвиг влево на 2 числа 5  = {e}')
'''

'''Задача 3
x1 = int(input('Введите координату Х первой точки: '))
y1 = int(input('Введите координату Y первой точки: '))
x2 = int(input('Введите координату Х второй точки: '))
y2 = int(input('Введите координату Y второй точки: '))
k = (y1 - y2) / (x1 - x2)
b = y2 - k*x2
print(f'Уравнение прямой для введёных координат: y = {k}x + {b}')
'''


'''Задача 4
import random

print('Укажите интервал целых чисел')
a = int(input('Введите начальное число интервала:  '))
b = int(input('Введите конечное число интервала: '))
print(f' Случайное число  = {random.randint(a,b)}\n')

print('Укажите интервал вещественных(с плавающей точкой) чисел')
a = float(input('Введите начальное число интервала:  '))
b = float(input('Введите конечное число интервала: '))
print(f' Случайное число  = {(random.uniform(a,b)):.2f}')

print('Укажите  символовы алфавита(латиница)')
first = input('Введите начальный символ:  ')
last = input('Введите конечный символ: ')
print('случайный символ в интервале ' + chr(random.randint(ord(first), ord(last))))
'''


'''Задача 5 --------- В задании не было написано в каком именно алфавите
-----
RU
-----
a = input('Введите первую букву: ')
b = input('Введите вторую букву: ')
print(f'Буква "{a}"  на {(ord(a)-1072)+1} месте')
print(f'Буква "{b}"  на {(ord(b)-1072)+1} месте')
print(f'Между "{a}" и "{b}"  {(ord(b)- ord(a))-1} букв(а)')

-----
ENG
-----
a = input('Введите первую букву: ')
b = input('Введите вторую букву: ')
print(f'Буква "{a}"  на {(ord(a)-97)+1} месте')
print(f'Буква "{b}"  на {(ord(b)-97)+1} месте')
print(f'Между "{a}" и "{b}"  {(ord(b)- ord(a))-1} букв(а)')
'''

'''Задача 6 Для латиницы
n = int(input('Номер буквы в алфавите: '))
n = ord('a') + n - 1

print('Это буква', chr(n))
'''


'''Задача 7
print("Необходимо ввести значения сторон")
a = int(input("Введите длину стороны a: "))
b = int(input("Введите длину стороны b: "))
c = int(input("Введите длину стороны c: "))

if a < (b + c) and b < (c + a) and c < (b + a):
    if a == b == c:
        print("Треугольник равносторонний")
    elif a == b or b == c or c == a:
        print("Треугольник равнобедренный")
    else:
        print("Треугольник разносторонний")
else:
    print("Не возможно постороить треугольник,где-то ошибочка")
'''

'''Задача 8
y = int(input("Какой интересует год? : "))
if (y % 4) == 0:
    if (y % 100) == 0:
        if (y % 400) == 0:
            print(f'Год - {y} , високосный')
        else:
            print(f'Год - {y} , не високосный')
    else:
        print(f'Год - {y} , високосный')
else:
    print(f'Год  - {y} , не високосный')
'''

'''Задача 9
print('Введите три разных числа: ')
a = int(input('Ведите первое число: '))
b = int(input('Ведите второе число: '))
c = int(input('Ведите третье число: '))

if b < a < c or c < a < b:
    print('Среднее:', a)
elif a < b < c or c < b < a:
    print('Среднее:', b)
else:
    print('Среднее:', c)
'''